<!-- dflook/terraform-github-actions {"workspace":"default","backend":"de4275a8dfee24784cc963911a31365bd657d27a847f901bea726cb3253c6155","backend_type":"gcs","plan_job_ref":"Job Create terraform plan #30 at https://github.com/paulsilcock/gke-terraform/actions/runs/3438702028","plan_hash":"8131d3ae5bb903e5c07710bb3fd1289365f58a2a81e64f68fe26ad26f3750dbc","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_address.ingress will be created
  + resource "google_compute_global_address" "ingress" {
      + address            = "34.89.32.55"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "ingress-nginx-lb"
      + project            = "gothic-album-364814"
      + self_link          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #30](https://github.com/paulsilcock/gke-terraform/actions/runs/3438702028)